global _start     ;начало трансляции в NASM
section .text
_start:

	;--------------------------------------------------------------------------------------------
	;Выделение места под глобальные переменные  (src/write_tree_in_nasm.cpp:97)
	;--------------------------------------------------------------------------------------------
	sub rsp, 2 * 8    ;выделение места под глобальные переменные (их количество == 2)
	mov rbx, rsp        ;rbx = указатель на глобальные переменные
	;--------------------------------------------------------------------------------------------

;описание 0 оператора  (src/write_tree_in_nasm.cpp:481)

	;начало var_declaration  long <variable>...   (src/write_tree_in_nasm.cpp:456)

	;начало assign <variable> = <expression>   (src/write_tree_in_nasm.cpp:414)

	;начало expression   (src/write_tree_in_nasm.cpp:417)

	;начало сканирования числа  (src/write_tree_in_nasm.cpp:657)

	call scanf_number    ;считывает число и кладёт его в rax  (src/write_tree_in_nasm.cpp:660)

	push rax       ;кладёт считанное число в стек   (src/write_tree_in_nasm.cpp:663)

	

	pop rdi    ;получает число для печати из стека   (src/write_tree_in_nasm.cpp:639)

	call printf_number    ;печатает число в rdi    (src/write_tree_in_nasm.cpp:642)

	;конец печати числа    (src/write_tree_in_nasm.cpp:645)

	;--------------------------------------------------------------------------------------------
	;Завершение работы программы    (src/write_tree_in_nasm.cpp:113)
	;Возвращает значение, которое к этом моменту хранится в rax
	;--------------------------------------------------------------------------------------------
	mov rdi, rax     ;exit64 (rdi)
	mov rax, 0x3C
	syscall
;--------------------------------------------------------------------------------------------

%INCLUDE "std_lib.s"
